{
    "profile": {
        "result": {
            "content": [
                {
                    "type": "text",
                    "text": "success: true\ndata:\n  id: \"461836327\"\n  username: carnelos.lucas\n  fullName: Lucas Carnelós"
                }
            ]
        },
        "jsonrpc": "2.0",
        "id": 1
    },
    "posts_operation": {
        "result": {
            "content": [
                {
                    "type": "text",
                    "text": "operationId: op_getInstagramPostsByUser_1771880557036_vx5a94\nstatus: running\ntoolName: getInstagramPostsByUser\ninstructions: \"IMMEDIATELY call checkOperationStatus with operationId \\\"op_getInstagramPostsByUser_1771880557036_vx5a94\\\" to get results. This is required - do not wait or try alternative approaches. Results will include: (1) paginated data, (2) dataDumpExportOperationId for CSV file url. YOU MUST ALSO call checkOperationStatus with the dataDumpExportOperationId to get the S3 download link.\"\nprogressToken: op_getInstagramPostsByUser_1771880557036_vx5a94\nhowPollingWorks: \"HOW POLLING WORKS: This operation runs in the background. To get results, you must use checkOperationStatus tool with the operationId provided below.\"\npollingMechanism: \"POLLING MECHANISM: (1) Call checkOperationStatus immediately with the operationId. (2) If status is \\\"running\\\", wait 5 seconds and call checkOperationStatus again. (3) Repeat step 2 until status becomes \\\"completed\\\", \\\"failed\\\", or \\\"cancelled\\\". (4) When completed, the response will contain your results.\"\nwhyPollingRequired: \"WHY POLLING IS REQUIRED: Operations process data asynchronously (often thousands of records). Results are not available immediately - you must actively check status until completion.\"\nwhatToExpect: \"WHAT TO EXPECT: First checkOperationStatus call will likely return \\\"running\\\" status with progress info. Continue polling every 5 seconds. Final call will return complete results with data.\"\ncsvExportNote: \"IMPORTANT: A full dataset CSV export is automatically initiated. You will receive a dataDumpExportOperationId in the results.\"\ncodeExecutionTip: \"The dataDumpExportOperationId will be in format \\\"op_datadump_TIMESTAMP_RANDOM\\\". Use it with checkOperationStatus to get the S3 signed URL for downloading the complete dataset CSV.\""
                }
            ],
            "_meta": {
                "progressToken": "op_getInstagramPostsByUser_1771880557036_vx5a94"
            }
        },
        "jsonrpc": "2.0",
        "id": 2
    }
}